blog/2020/hugo-set-shortcode.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-01-09 Sun 11:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hugo 设置 shortcode</title>
<meta name="generator" content="Org mode">
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Hugo 设置 shortcode</h1>
</header>
<div id="outline-container-align" class="outline-2">
<h2 id="align">align</h2>
<div class="outline-text-2" id="text-align">
<p>
对文字进行居中、居左、居右的设置。在 <code>~/layouts/shortcodes/</code> 下创建
=align.html=，内容如下：
</p>

<pre class="example" id="org8a4e8a3">
&lt;!-- 文件位置：~/layouts/shortcodes/align.html --&gt;

&lt;p style="text-align:{{ index .Params 0 }}"&gt;{{ index .Params 1 | markdownify }}&lt;/p&gt;
</pre>

<p>
具体简码样式：
</p>

<pre class="example" id="org362c35b">
{{&lt;/* align left "文字" */&gt;}}

{{&lt;/* align center "文字" */&gt;}}

{{&lt;/* align right "文字" */&gt;}}
</pre>

<p>
{{&lt; align left "文字" &gt;}}
</p>

<p>
{{&lt; align center "文字" &gt;}}
</p>

<p>
{{&lt; align right "文字" &gt;}}
</p>
</div>
</div>

<div id="outline-container-github" class="outline-2">
<h2 id="github">github</h2>
<div class="outline-text-2" id="text-github">
<p>
新建文件 github.html
</p>

<pre class="example" id="orga3d1159">
&lt;!-- 文件位置：~/layouts/shortcodes/github.html --&gt;

&lt;div class="github"&gt;
    &lt;div class="logo"&gt;
        {{ replace $.Site.Data.SVG.repository "icon" "icon github-icon" | safeHTML }}
        &lt;a class="name" href={{ .Get "link" }} target="_blank"&gt;{{ .Get "name" }}&lt;/a&gt;
    &lt;/div&gt;
    &lt;div class="description"&gt;{{ .Get "description" }}&lt;/div&gt; 
    &lt;div class="language"&gt;
        &lt;span class="language-color" style="background-color: {{ .Get "color" }}"&gt;&lt;/span&gt;
        &lt;span class="language-name"&gt;{{ .Get "language" }}&lt;/span&gt;
    &lt;/div&gt;
&lt;/div&gt;
</pre>

<p>
然后添加自定义 CSS 样式。在 <code>~/assets/scss/custom/_custom.scss</code>
文件中添加如下内容：
</p>

<pre class="example" id="org135206e">
// 文件位置：~/assets/scss/custom/_custom.scss

.github {
    border: 1px solid var(--color-contrast-low);
    border-radius: 3px;
    margin: 0 auto;
    margin-bottom: 1em;
    padding: 1em;
    .github-icon {
        width: 1.2em;
        height: 1.2em;
        margin-right: 0.5em;
        margin-bottom: 0.2em;
        fill: var(--color-contrast-high);
        transition: all .5s;
    }
    .name {
        font-weight: bold;
        color: var(--color-primary);
        text-decoration: none;
    }
    .description {
        margin-top: 0.5em;
        margin-bottom: 1em;
        color: var(--color-contrast-high);
        text-align: justify;
        font-size: 90%;
        transition: all .5s;
    }
    .language-color {
        position: relative;
        top: 1px;
        display: inline-block;
        width: 0.75em;
        height: 0.75em;
        border-radius: 50%;
    }
    .language-name {
        color: var(--color-contrast-high);
        font-size: 90%;
        margin-left: 0.5em;
        transition: all .5s;
    }
}
</pre>

<p>
最后需要在 <code>~/data/SVG.toml</code> 文件中插入图标：
</p>

<pre class="example" id="org1d2e4dd">
# 文件位置：~/data/SVG.toml

# GitHub Icon
repository = '&lt;svg xmlns="http://www.w3.org/2000/svg" class="icon" viewBox="0 0 16 16"&gt;&lt;path fill-rule="evenodd" clip-rule="evenodd" d="M2 2.5C2 1.83696 2.26339 1.20107 2.73223 0.732233C3.20108 0.263392 3.83696 0 4.5 0L13.25 0C13.4489 0 13.6397 0.0790176 13.7803 0.21967C13.921 0.360322 14 0.551088 14 0.75V13.25C14 13.4489 13.921 13.6397 13.7803 13.7803C13.6397 13.921 13.4489 14 13.25 14H10.75C10.5511 14 10.3603 13.921 10.2197 13.7803C10.079 13.6397 10 13.4489 10 13.25C10 13.0511 10.079 12.8603 10.2197 12.7197C10.3603 12.579 10.5511 12.5 10.75 12.5H12.5V10.5H4.5C4.30308 10.5 4.11056 10.5582 3.94657 10.6672C3.78257 10.7762 3.65442 10.9312 3.57816 11.1128C3.50191 11.2943 3.48096 11.4943 3.51793 11.6878C3.5549 11.8812 3.64816 12.0594 3.786 12.2C3.92524 12.3422 4.0023 12.5338 4.00024 12.7328C3.99818 12.9318 3.91716 13.1218 3.775 13.261C3.63285 13.4002 3.4412 13.4773 3.24222 13.4752C3.04325 13.4732 2.85324 13.3922 2.714 13.25C2.25571 12.7829 1.99929 12.1544 2 11.5V2.5ZM12.5 1.5V9H4.5C4.144 9 3.806 9.074 3.5 9.208V2.5C3.5 2.23478 3.60536 1.98043 3.79289 1.79289C3.98043 1.60536 4.23478 1.5 4.5 1.5H12.5ZM5 12.25V15.5C5 15.5464 5.01293 15.5919 5.03734 15.6314C5.06175 15.6709 5.09667 15.7028 5.1382 15.7236C5.17972 15.7444 5.22621 15.7532 5.27245 15.749C5.31869 15.7448 5.36286 15.7279 5.4 15.7L6.85 14.613C6.89328 14.5805 6.94591 14.563 7 14.563C7.05409 14.563 7.10673 14.5805 7.15 14.613L8.6 15.7C8.63714 15.7279 8.68131 15.7448 8.72755 15.749C8.77379 15.7532 8.82028 15.7444 8.8618 15.7236C8.90333 15.7028 8.93826 15.6709 8.96266 15.6314C8.98707 15.5919 9 15.5464 9 15.5V12.25C9 12.1837 8.97366 12.1201 8.92678 12.0732C8.87989 12.0263 8.81631 12 8.75 12H5.25C5.1837 12 5.12011 12.0263 5.07322 12.0732C5.02634 12.1201 5 12.1837 5 12.25Z"/&gt;&lt;/svg&gt;'
</pre>

<p>
你需要在简码中填写仓库名 =name=，仓库链接 =link=，仓库描述
=description=，代码语言 =language=，代码语言对应的颜色 =color=。
</p>

<p>
具体简码和样式如下：
</p>

<pre class="example" id="orgf7b8362">
{{&lt;/* github name="blog" link="https://github.com/tianheg/blog" description="Blog Source Files" color="#E34C26" language="HTML" */&gt;}}
</pre>

<p>
{{&lt; github name="blog" link="<a href="https://github.com/tianheg/blog">https://github.com/tianheg/blog</a>"
description="Blog Source Files" color="#E34C26" language="HTML"&gt;}}
</p>
</div>
</div>

<div id="outline-container-gallery" class="outline-2">
<h2 id="gallery">gallery</h2>
<div class="outline-text-2" id="text-gallery">
<pre class="example" id="org057e1c8">
{{&lt;/* gallery dir="/images/friends/" /&gt;}} {{&lt; load-photoswipe */&gt;}}
# 这是添加组合图片的短代码
</pre>
</div>
</div>

<div id="outline-container-notice" class="outline-2">
<h2 id="notice">notice</h2>
<div class="outline-text-2" id="text-notice">
<p>
{{}} 内容 {{}}
</p>

<pre class="example" id="orgd9467a5">
{{&lt;/*notice notice-warning&gt;}}
内容
{{&lt;/notice*/&gt;}}
</pre>

<p>
{{}} 内容 {{}}
</p>

<pre class="example" id="org9b72a8f">
{{&lt;/*notice notice-tip&gt;}}
内容
{{&lt;/notice*/&gt;}}
</pre>

<p>
{{}} 内容 {{}}
</p>

<pre class="example" id="orgce8ea57">
{{&lt;/*notice notice-info&gt;}}
内容
{{&lt;/notice*/&gt;}}
</pre>

<p>
{{}} 内容 {{}}
</p>

<pre class="example" id="org7ef8dcb">
{{&lt;/*notice notice-note&gt;}}
内容
{{&lt;/notice*/&gt;}}
</pre>
</div>
</div>

<div id="outline-container-gist" class="outline-2">
<h2 id="gist">gist</h2>
<div class="outline-text-2" id="text-gist">
<p>
{{&lt; gist tianheg 1ce40c3e06eddab6bc72b87cc26ec067 &gt;}}
</p>

<pre class="example" id="org6f794f9">
{{&lt;/* gist tianheg 1ce40c3e06eddab6bc72b87cc26ec067 */&gt;}}
</pre>
</div>
</div>

<div id="outline-container-year" class="outline-2">
<h2 id="year">year</h2>
<div class="outline-text-2" id="text-year">
<p>
{{&lt; year &gt;}}
</p>

<pre class="example" id="org99b4d57">
{{&lt;/* year */&gt;}}
</pre>
</div>
</div>

<div id="outline-container-highlight" class="outline-2">
<h2 id="highlight">highlight</h2>
<div class="outline-text-2" id="text-highlight">
<p>
highlighted text
</p>

<pre class="example" id="org5fdb005">
&lt;mark&gt;highlighted text&lt;/mark&gt;
</pre>

<pre class="example" id="orge4cbdc2">
添加\layouts\shortcodes\highlight.html：
&lt;highlight html &gt;
&lt;section id="main"&gt;
  &lt;div&gt;
   &lt;h1 id="title"&gt;{{ .Title }}&lt;/h1&gt;
    {{ range .Data.Pages }}
        {{ .Render "summary"}}
    {{ end }}
  &lt;/div&gt;
&lt;/section&gt;
&lt;/highlight &gt;
</pre>

<p>
print('hello world')
</p>

<p>
没有报错，但是没有高亮
</p>
</div>
</div>

<div id="outline-container-quote" class="outline-2">
<h2 id="quote">quote</h2>
<div class="outline-text-2" id="text-quote">
<p>
中文：
</p>

<p>
{{&lt; quote &gt;}}
教育，特别是未成年人的教育，一定要尽量将偏见和仇恨压到最低，以至于无。我们唯一要仇恨的就是仇恨本身，我们最应该对偏见本身有偏见。我不希望我们的下一代生活在仇恨之中，我不希望我们的下一代还有战争和屠杀，我不希望我们的下一代还有“儿童党卫军”等组织，我不希望我们的下一代还高唱忠于领袖、忠于组织的赞歌。我希望我们的下一代在和平的环境中，享受面包和音乐；我希望我们的下一代，无论什么肤色和信仰都可以平等和平的交流；我希望我们的下一代自由地选择自己喜欢的生活，而不是做任何人或任何组织的“螺丝钉”；我希望我们的下一代都内心甜美、热爱自由，各美其美；我希望我们的下一代忠于自己的良知和责任，成为有思想、有智慧、有爱心的好人。
{{&lt; /quote &gt;}}
</p>

<pre class="example" id="org86e0b43">
{{&lt;/* quote &gt;}}
教育，特别是未成年人的教育，一定要尽量将偏见和仇恨压到最低，以至于无。我们唯一要仇恨的就是仇恨本身，我们最应该对偏见本身有偏见。我不希望我们的下一代生活在仇恨之中，我不希望我们的下一代还有战争和屠杀，我不希望我们的下一代还有“儿童党卫军”等组织，我不希望我们的下一代还高唱忠于领袖、忠于组织的赞歌。我希望我们的下一代在和平的环境中，享受面包和音乐；我希望我们的下一代，无论什么肤色和信仰都可以平等和平的交流；我希望我们的下一代自由地选择自己喜欢的生活，而不是做任何人或任何组织的“螺丝钉”；我希望我们的下一代都内心甜美、热爱自由，各美其美；我希望我们的下一代忠于自己的良知和责任，成为有思想、有智慧、有爱心的好人。
{{&lt; /quote */&gt;}}
</pre>

<p>
英文：
</p>

<p>
{{&lt; quote en &gt;}} /We don't read and write poetry because it's cute. We
read and write poetry because we are members of the human race. And the
human race is filled with passion./ {{&lt; /quote &gt;}}
</p>

<pre class="example" id="org2ae050e">
{{&lt;/* quote en &gt;}}
*We don't read and write poetry because it's cute. We read and write poetry because we are members of the human race. And the human race is filled with passion.*
{{&lt; /quote */&gt;}}
</pre>

<p>
{{&lt; quote-center &gt;}}
毕竟西湖六月中风光不与四时同接天莲叶无穷碧映日荷花别样红
</p>

<p>
{{&lt; /quote-center &gt;}}
</p>

<pre class="example" id="org2a1cb45">
{{&lt;/* quote-center &gt;}}
毕竟西湖六月中&lt;br&gt;风光不与四时同&lt;br&gt;接天莲叶无穷碧&lt;br&gt;映日荷花别样红
{{&lt; /quote-center */&gt;}}
</pre>

<p>
{{&lt; wp tag="Wikipedia:历史上的今天" lang="zh" title="历史上的今天" &gt;}}
</p>

<pre class="example" id="orgce0ae24">
{{&lt;/* wp tag="Wikipedia:历史上的今天" lang="zh" title="历史上的今天" */&gt;}}
</pre>

<pre class="example" id="orgbf5a47e">
{{&lt;/* bili aid="625811282" cid="197006223" */&gt;}}
# aid 和 cid 可以通过页面的源码获得(按 Ctrl+U 打开页面源码)
</pre>

<hr>

<p>
*参考链接*：
</p>

<ol class="org-ol">
<li><a href="https://guanqr.com/tech/website/hugo-shortcodes-customization/">自定义
Hugo Shortcodes 简码</a></li>
<li><a href="https://hugoloveit.com/zh-cn/theme-documentation-extended-shortcodes/">主题文档 -
扩展 Shortcodes</a></li>
</ol>
</div>
</div>
</div>
</body>
</html>